
&НаКлиенте
Процедура СрокКредитаПриИзменении(Элемент)
	ОбновитьКоэффициентАннуитета();
	ПерезаполнитьРасчетнуюТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаКредитованияПриИзменении(Элемент)
	ОбновитьКоэффициентАннуитета();
	ПерезаполнитьРасчетнуюТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоэффициентАннуитета()
	Если ЭтотОбъект.СтавкаКредитования = 0
		Или ЭтотОбъект.СрокКредита = 0 Тогда
		КоэффициентАннуитета = 0;
		Возврат;
	КонецЕсли; 
	СтавкаКредитованияСотые = ЭтотОбъект.СтавкаКредитования/100/12;
	Показатель1 = Pow(1 + СтавкаКредитованияСотые, ЭтотОбъект.СрокКредита);
	КоэффициентАннуитета = СтавкаКредитованияСотые * Показатель1 / (Показатель1 - 1);
КонецПроцедуры


&НаКлиенте
Процедура ПерезаполнитьРасчетнуюТаблицу()
	
	// Ничего более прямого не придумал
	Если ЭтотОбъект.РасчетнаяТаблица.Количество() > ЭтотОбъект.СрокКредита Тогда
		КоличествоУдалить = ЭтотОбъект.РасчетнаяТаблица.Количество() - ЭтотОбъект.СрокКредита;
		Для Сч = 1 По КоличествоУдалить Цикл
			РасчетнаяТаблица.Удалить(ЭтотОбъект.РасчетнаяТаблица.Количество() - 1);
		КонецЦикла;
	ИначеЕсли ЭтотОбъект.РасчетнаяТаблица.Количество() < ЭтотОбъект.СрокКредита Тогда
		КоличествоДобавить =  ЭтотОбъект.СрокКредита - ЭтотОбъект.РасчетнаяТаблица.Количество();
		Для Сч = 1 По КоличествоДобавить Цикл
			НоваяСтрока = ЭтотОбъект.РасчетнаяТаблица.Добавить();
			НоваяСтрока.НомерПериода = ЭтотОбъект.РасчетнаяТаблица.Количество();
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтотОбъект.СуммаКредита = 0 или ЭтотОбъект.СрокКредита = 0 Или ЭтотОбъект.СтавкаКредитования = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ОстатокКУплате = ЭтотОбъект.СуммаКредита;
	
	
	
	ЕжемесячнаяСтавка = ЭтотОбъект.СтавкаКредитования / 12 / 100;
	// Расчет аннуитетного платежа
	СуммаЕжемесячногоПлатежа = 	ЭтотОбъект.СуммаКредита / (1-1/pow((1 + ЕжемесячнаяСтавка), ЭтотОбъект.СрокКредита)) * ЕжемесячнаяСтавка;
	

	
	
	Для Каждого СтрокаТЗ Из ЭтотОбъект.РасчетнаяТаблица Цикл
		СтрокаТЗ.СуммаПлатежа 				= СуммаЕжемесячногоПлатежа;
		СтрокаТЗ.СуммаПогашенияПроцентов 	= ОстатокКУплате * ЭтотОбъект.СтавкаКредитования / 12 / 100;
		СтрокаТЗ.СуммаПогашенияОД 			= СтрокаТЗ.СуммаПлатежа - СтрокаТЗ.СуммаПогашенияПроцентов;
		СтрокаТЗ.ОстатокКУплатеОД 			= ОстатокКУплате - СтрокаТЗ.СуммаПогашенияОД - СтрокаТЗ.СуммаДопПлатежа;
		ОстатокКУплате 						= СтрокаТЗ.ОстатокКУплатеОД;
		
		Если СтрокаТЗ.СуммаДопПлатежа > 0  Тогда
			СуммаЕжемесячногоПлатежа = СтрокаТЗ.ОстатокКУплатеОД  / (1-1/pow((1 + ЕжемесячнаяСтавка), ЭтотОбъект.СрокКредита - СтрокаТЗ.НомерПериода)) * ЕжемесячнаяСтавка;
		КонецЕсли; 
		
	КонецЦикла;
	
	ПересчитатьИтоговыеПоказатели();
	
КонецПроцедуры


&НаКлиенте
Процедура СуммаКредитаПриИзменении(Элемент)
	ПерезаполнитьРасчетнуюТаблицу();
КонецПроцедуры

&НаКлиенте 
Процедура ПересчитатьИтоговыеПоказатели()
	
	ЭтотОбъект.ПогашениеОДИтого = ЭтотОбъект.РасчетнаяТаблица.Итог("СуммаПогашенияОД");
	ЭтотОбъект.ПогашениеПроцентовИтого = ЭтотОбъект.РасчетнаяТаблица.Итог("СуммаПогашенияПроцентов");
	
	ЭтотОбъект.Альт_СуммаСбереженийЗаМесяц = ЭтотОбъект.СуммаКредита / ЭтотОбъект.СрокКредита;
	ЭтотОбъект.Альт_СуммаКоммуналки = 5000;
	ЭтотОбъект.Альт_МаксимальнаяСуммаАренды = (ЭтотОбъект.ПогашениеОДИтого + ЭтотОбъект.ПогашениеПроцентовИтого ) / ЭтотОбъект.СрокКредита - ЭтотОбъект.Альт_СуммаСбереженийЗаМесяц + ЭтотОбъект.Альт_СуммаКоммуналки;
	
КонецПроцедуры

&НаКлиенте
Процедура Альт_СуммаКоммуналкиПриИзменении(Элемент)
	ПересчитатьИтоговыеПоказатели();
КонецПроцедуры

&НаКлиенте
Процедура РасчетнаяТаблицаСуммаДопПлатежаПриИзменении(Элемент)
	ПерезаполнитьРасчетнуюТаблицу();
КонецПроцедуры





